Repository: cloud-py-api/ui_example
Catalog: locale/*/LC_MESSAGES/ui_example.po
Languages: uk

source: UI example
uk: Приклад UI

source: Example of declarative settings
uk: Приклад декларативних налаштувань

source: These fields are rendered dynamically from declarative schema
uk: Ці поля сгенеровані динамічно з декларавтиної схеми

source: Select some option setting
uk: Виберіть якусь опцію

source: Select some multiple options
uk: Виберіть якісь множинні опції

source: Choose init status check background job interval
uk: Виберіть інтервал фонової задачі перевірки статусу

source: How often ExApp should check for initialization status
uk: Як часто виконувати перевірку ініціалізації

source: Each 40 minutes
uk: Кожні 40 хвилин

source: Each 60 minutes
uk: Кожні 60 хвилин

source: Each 120 minutes
uk: Кожні 120 хвилин

source: Each day
uk: Кожен день

source: Default text field
uk: Звичайне текстове поле

source: Set some simple text setting
uk: Встановити простий текстовий параметр

source: Enter text setting
uk: Параметр email

source: Email field
uk: Поле email

source: Set email config
uk: Встановіть email конфугурацію

source: Enter email
uk: Введіть email

source: Tel field
uk: Поле телефону

source: Set tel config
uk: Вкажіть конфігурації телефону

source: Enter your tel
uk: Введіть ваш телефон

source: Url (website) field
uk: Посилання на веб-сайт

source: Set url config
uk: Встановіть конфігурацію посилання

source: Enter url
uk: Введіть посилання

source: Number field
uk: Введіть число

source: Set number config
uk: Опція число

source: Enter number value
uk: Введіть числову конфігурацію

source: Password
uk: Пароль

source: Set some secure value setting
uk: Встановіть захищене значення параметру

source: Set secure value
uk: Встановіть захищене значення

source: Selection
uk: Випадаючий список

source: Toggle something
uk: Перемикач

source: Select checkbox option setting
uk: Виберіть чекбокс

source: Verify something if enabled
uk: Верифікувати чи щось увімкнено

source: Multiple checkbox toggles, describing one setting
uk: Множинні чекбокс перемикачі, відповідаючих одному параметру

source: Radio toggles, describing one setting like single select
uk: Радіо перемикачі, відповідаючих одному параметру як одиночний select

source: Select radio option setting
uk: Налаштування одиночний перемикач

source: Select single toggle
uk: Одиночний перемикач

source: First radio
uk: Перший перемикач

source: Second radio
uk: Другий перемикач

source: Third radio
uk: Третій перемикач

source: Test menu
uk: Тестове меню

source: Test notification subject
uk: Тестовий заголовок повідомлення

source: Test notification message
uk: Тестовий зміст повідомлення

source: UI Example
uk: Приклад UI

source: Example of displaying UI elements with l10n support
uk: Приклад відображення UI елементів з підтримкою перекладів

source: UI & Translations skeleton of the Nextcloud application written in Python
uk: Найпростіший шаблон Nextcloud застосунку написаного за допомогою Python

source: Home page
uk: Додому

source: Files page
uk: Файли

source: ExApp UI example
uk: Приклад UI

source: All front-end stuff kept the same for seamless migration for developers. All needed stuff is proxying via AppAPI
uk: Для фронтенду все залишилось як було для безшовної міграції для розробників. Всі необхідні речі проксовані через AppAPI

source: Initial value
uk: Базове значення

source: Initial value from store
uk: Базове значення з магазину

source: Verify initial value
uk: Підтвердити базове значення

source: Test file pickers
uk: Тест вибору файлу

source: Selected file from Nextcloud:
uk: Вибраний файл з Nextcloud:

source: File info:
uk: Інформація про файл:

source: File size:
uk: Розмір файлу:

source: Select test file
uk: Обрати тестовий файл

source: Send test file to ExApp
uk: Відправити тестовий файл до ExApp

source: Selected from File Actions Menu:
uk: Вибрані файли з контекстного меню

source: File ids:
uk: Обрані файли:

source: Files search info:
uk: Інформація вибраних файлів:

source: ExApp UI Example
uk: Приклад UI

source: ExApp send file
uk: ExApp відправити файл

source: Initial value is correct
uk: Базове значення правильне

source: Initial value is incorrect
uk: Базове значення неправильне

source: File sent
uk: Файл відправлено

source: Failed to send file
uk: Помилка відправки файлу
